Управление_торговлей.ПБТ/src/Documents/НастройкаЗначенийПоказателей/НастройкаЗначенийПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НастройкаЗначенийПоказателей</name>
  <basedOn>Document.ПротоколАнализа</basedOn>
  <registerRecords>InformationRegister.ШаблоныЗначенийПоказателей</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДляПоказателейВТУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТУ</name>
    <type>
      <types>CatalogRef.ТУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИсследования</name>
    <type>
      <types>CatalogRef.ВидыИсследований</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>наАнглийскомЯзыке</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Номенклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/InformationRegisters/ШаблоныЗначенийПоказателей/ШаблоныЗначенийПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШаблоныЗначенийПоказателей</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.Нормативы</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>наАнглийскомЯзыке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидИсследования</name>
    <type>
      <types>CatalogRef.ВидыИсследований</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.Нормативы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей.ПБТ/src/InformationRegisters/НормативыНоменклатурыЛаб/НормативыНоменклатурыЛаб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормативыНоменклатурыЛаб</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВариантСравнения</name>
    <type>
      <types>EnumRef.ВариантыСравнения</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Интервал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>наАнглийскомЯзыке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПорядокСл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимоеОтклонение</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.ПериодичностьЛаб</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеВыводитьВУК</name>
    <comment>0013660</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УсловияПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидИсследования</name>
    <type>
      <types>CatalogRef.ВидыИсследований</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.Нормативы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНорматива</name>
    <type>
      <types>CatalogRef.ХарактеристикиНормативов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей.ПБТ/src/Documents/НастройкаЗначенийПоказателей/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Для каждого СтрНом Из Номенклатуры Цикл
		Если Не ЗначениеЗаполнено(СтрНом.Номенклатура) Тогда
			Продолжить;
		КонецЕсли; 
		
		Для каждого ТекСтрокаТЧ_Показатели Из ТЧ_Показатели Цикл
			Движение = Движения.ШаблоныЗначенийПоказателей.Добавить();
			Движение.Период = Дата;
			Движение.ВидИсследования = ВидИсследования;
			Движение.Показатель = ТекСтрокаТЧ_Показатели.Показатель;
			//Движение.Номенклатура = Номенклатура;
			Движение.Номенклатура = СтрНом.Номенклатура;
			Движение.Значение = ТекСтрокаТЧ_Показатели.Значение;
			Движение.наАнглийскомЯзыке = ТекСтрокаТЧ_Показатели.наАнглийскомЯзыке;
			Движение.ЕдиницаИзмерения = ТекСтрокаТЧ_Показатели.ЕдиницаИзмерения;
		КонецЦикла;
	КонецЦикла; 
	
	// записываем движения регистров
	Движения.ШаблоныЗначенийПоказателей.Записать();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если Не ЗначениеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли; 	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПротоколАнализа") Тогда
		// Заполнение шапки
		Дата = НачалоДня(Основание.Дата)+60;
		Пользователь = Пользователь = Пользователи.ТекущийПользователь();//Основание.Пользователь;
		
		//заполняем всеми номенклатурами из группы
		//ГруппаТУ = Основание.Номенклатура.ГруппаДляПоказателейВТУ;
		Номенклатура = Основание.Номенклатура;
		ГруппаДляПоказателейВТУ = УправлениеСвойствами.ЗначениеСвойства(Номенклатура, "ГруппаДляПоказателейВТУ");
		
		ТУ = ГруппаДляПоказателейВТУ.Владелец;
		Документы.НастройкаЗначенийПоказателей.ЗаполнитьНоменклатуру(ЭтотОбъект);
		
		ВидИсследования = Основание.ВидИсследования;
		
		// Заполнение ТЧ показателей
		//не все показатели должны попадать в этот документа, а только те, у которых не стоит галочка "
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПротоколАнализаТЧ_Показатели.Ссылка,
		|	ПротоколАнализаТЧ_Показатели.ЕдиницаИзмерения,
		|	ПротоколАнализаТЧ_Показатели.Значение,
		|	ПротоколАнализаТЧ_Показатели.Показатель,
		|	НормативыНоменклатурыЛабСрезПоследних.НеВыводитьВУК
		|ИЗ
		|	Документ.ПротоколАнализа.ТЧ_Показатели КАК ПротоколАнализаТЧ_Показатели
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормативыНоменклатурыЛаб.СрезПоследних(&НаДату, ) КАК НормативыНоменклатурыЛабСрезПоследних
		|		ПО ПротоколАнализаТЧ_Показатели.Показатель = НормативыНоменклатурыЛабСрезПоследних.Показатель
		|			И ПротоколАнализаТЧ_Показатели.Ссылка.Номенклатура = НормативыНоменклатурыЛабСрезПоследних.Номенклатура
		|ГДЕ
		|	ПротоколАнализаТЧ_Показатели.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("НаДату", Основание.Дата);
		Запрос.УстановитьПараметр("Ссылка", Основание);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			//Для Каждого ТекСтрокаТЧ_Показатели Из Основание.ТЧ_Показатели Цикл
			Если Выборка.НеВыводитьВУК = Истина Тогда
				Продолжить;
			КонецЕсли; 
			НоваяСтрока = ТЧ_Показатели.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
			НоваяСтрока.Значение = Выборка.Значение;
			НоваяСтрока.Показатель = Выборка.Показатель;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
